Autodesk.Revit.UI.SplitButton.CurrentButton
Gets or sets the current PushButton of the SplitButton.
Remarks: This property is applicable only if IsSynchronizedWithCurrentItem is true.
The default value of this property will be the first enabled PushButton in the drop down list after the SplitButton is shown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when trying to set the CurrentButton to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when trying to set the CurrentButton to a button which is not in current drop-down list.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when trying to set the CurrentButton if IsSynchronizedWithCurrentItem is false.
Since: 2011

Autodesk.Revit.UI.SplitButton.IsSynchronizedWithCurrentItem
Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property.
Remarks:
If this property is true the SplitButton uses the current PushButton's properties to display the image, text, tooltip,
etc. and executes the current item when clicked. If it is false the first listed PushButton in the GetItems() return is shown,
and executes this PushButton when clicked.
If it is false the items in drop down list can only be executed by opening the drop down list and clicking an item in the list.
The default value is true.
Since: 2011

Autodesk.Revit.UI.SplitButton
The SplitButton object represents a button with a clickable button appearing above a pulldown.
Remarks: Use of this class is not supported in Revit Macros.
Since: 2011